# 3. Написать функцию, аргументы имена сотрудников, возвращает словарь, ключи — первые буквы имён, значения — списки, содержащие имена, начинающиеся с соответствующей буквы.
# in
# "Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"
# out

# {'А': ['Алина'], 'Б': ['Бибочка'], 'И': ['Иван', 'Илья'], 'М': ['Марина', 'Мария'], 'П': ['Петр', 'Петр']}

def dictionary_names(*names):
    dict_names = {}
    for i in names:
        key = i[0]
        if key in dict_names:
            dict_names[key].append(i)
        else:
            dict_names[key] = [i]

    return dict_names

print(dictionary_names("Иван", "Мария", "Петр", "Илья", "Марина", "Петр", "Алина", "Бибочка"))